КАКерамика_моя_старая_база/src/Documents/КонтурЛогистика_ПЛ_Титул5_5_02/КонтурЛогистика_ПЛ_Титул5_5_02.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КонтурЛогистика_ПЛ_Титул5_5_02</name>
  <posting>Deny</posting>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DefinedType.КонтурЛогистика_ДокументыУчетнойСистемы</types>
    </type>
  </attributes>
  <attributes>
    <name>Титул1</name>
    <type>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул1_5_02</types>
    </type>
  </attributes>
  <attributes>
    <name>Титул2</name>
    <type>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул2_5_02</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>будет отображаться только в диадоке, не попадет в ЭтРН</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатИнфПМО</name>
    <comment>Дата формирования файла обмена информации о прохождении послесменного, послерейсового медицинского осмотра</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВрИнфПМО</name>
    <comment>Время формирования файла обмена информации о прохождении послесменного, послерейсового медицинского осмотра</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатФайлИнфМО</name>
    <comment>Дата формирования файла обмена информации прохождении предсменного, предрейсового медицинского осмотра</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВрФайлИнфМО</name>
    <comment>Время формирования файла обмена информации прохождении предсменного, предрейсового медицинского осмотра</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдФайлИнфМО</name>
    <comment>Идентификатор файла обмена информации прохождении предсменного, предрейсового медицинского осмотра</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭППредрейсовыйМО</name>
    <comment>Электронная подпись файла обмена инфЭлектронная подпись файла обмена информации о прохождении предсменного, предрейсового медицинского осмотра</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидМОПослесменный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>128</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипПодпис</name>
    <type>
      <types>EnumRef.КонтурЛогистика_ТипыПодписи</types>
    </type>
  </attributes>
  <attributes>
    <name>СпосПодтПолном</name>
    <type>
      <types>EnumRef.КонтурЛогистика_СпособыПодтвержденияПолномочий</types>
    </type>
  </attributes>
  <attributes>
    <name>Фамилия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>60</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>60</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отчество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>60</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПользовательПодписант</name>
    <type>
      <types>DefinedType.КонтурЛогистика_Пользователи1С</types>
    </type>
  </attributes>
  <attributes>
    <name>ПараметрНастроекПодписания</name>
    <comment>Параметр используется для поиска подписанта по дополнительному параметру</comment>
    <type>
      <types>DefinedType.КонтурЛогистика_ЗначениеНастроек</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаОтказаВПодписи</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьОтказВПодписи</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МедРаботник</name>
    <comment>Заполняется, если медицинский работник состоит в штате юридического лица или индивидуального предпринимателя, осуществляющего деятельность по перевозке пассажиров и багажа, грузов</comment>
    <type>
      <types>CatalogRef.КонтурЛогистика_Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатВрПрМО</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Водитель</name>
    <type>
      <types>CatalogRef.КонтурЛогистика_Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>МедЛицензия</name>
    <type>
      <types>CatalogRef.КонтурЛогистика_Лицензии</types>
    </type>
  </attributes>
  <attributes>
    <name>ДистанционныйМедОсмотр</name>
    <comment>Признак использования медицинских изделий, обеспечивающих автоматизированную дистанционную передачу информации о состоянии здоровья работников и дистанционный контроль состояния их здоровья</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РезультатМедОсмотра</name>
    <type>
      <types>EnumRef.КонтурЛогистика_РезультатыПослерейсовогоМедОсмотра</types>
    </type>
  </attributes>
  <attributes>
    <name>ДопСведенияОПодписанте</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеПолучателиФайла</name>
    <attributes>
      <name>ОрганизацияДиадок</name>
      <type>
        <types>CatalogRef.КонтурЛогистика_ОрганизацииДиадок</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИнфПол</name>
    <comment>Информационные поля</comment>
    <attributes>
      <name>ИдФайлИнфПол</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Идентиф</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <comment>T(1-2000)</comment>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

КАКерамика_моя_старая_база/src/Enums/КонтурЛогистика_СтатусыТитулов/КонтурЛогистика_СтатусыТитулов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КонтурЛогистика_СтатусыТитулов</name>
  <comment>Это статусы доставки в Диадок. Логистические статусы смотри в спр. КонтурЛогистика_СостоянияДвиженияДокументооборота</comment>
  <enumValues>
    <name>Пропущен</name>
  </enumValues>
  <enumValues>
    <name>Удален</name>
  </enumValues>
  <enumValues>
    <name>Ошибка</name>
  </enumValues>
  <enumValues>
    <name>Черновик</name>
  </enumValues>
  <enumValues>
    <name>ПодготовленКОтправке</name>
  </enumValues>
  <enumValues>
    <name>СформированыФайлыОбмена</name>
  </enumValues>
  <enumValues>
    <name>Подписан</name>
  </enumValues>
  <enumValues>
    <name>РаботаЗавершенаРаспечатан</name>
  </enumValues>
  <enumValues>
    <name>РаботаЗавершенаОтказВПодписи</name>
  </enumValues>
  <enumValues>
    <name>РаботаЗавершена</name>
  </enumValues>
  <enumValues>
    <name>Получен</name>
    <comment>для титулов, которые были загружены из Диадока</comment>
  </enumValues>
  <enumValues>
    <name>ПолученТребуетОбработки</name>
  </enumValues>
  <enumValues>
    <name>ПолученОбработанСПредупреждением</name>
  </enumValues>
</mdclass:Enum>

КАКерамика_моя_старая_база/src/Enums/КонтурЛогистика_ТипыЛогистическихДокументов/КонтурЛогистика_ТипыЛогистическихДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КонтурЛогистика_ТипыЛогистическихДокументов</name>
  <enumValues>
    <name>ТрН_Титул1</name>
  </enumValues>
  <enumValues>
    <name>ТрН_Титул2</name>
  </enumValues>
  <enumValues>
    <name>ТрН_Титул3</name>
  </enumValues>
  <enumValues>
    <name>ТрН_Титул4</name>
  </enumValues>
  <enumValues>
    <name>ТрН_Титул5</name>
  </enumValues>
  <enumValues>
    <name>ТрН_Титул6</name>
  </enumValues>
  <enumValues>
    <name>ТрН_Титул7</name>
  </enumValues>
  <enumValues>
    <name>ТрН_Титул8</name>
  </enumValues>
  <enumValues>
    <name>ЗН_Титул1</name>
  </enumValues>
  <enumValues>
    <name>ЗН_Титул2</name>
  </enumValues>
  <enumValues>
    <name>ЗН_Титул3</name>
  </enumValues>
  <enumValues>
    <name>ЗН_Титул4</name>
  </enumValues>
  <enumValues>
    <name>СВ_Титул1</name>
  </enumValues>
  <enumValues>
    <name>СВ_Титул2</name>
  </enumValues>
  <enumValues>
    <name>СВ_Титул3</name>
  </enumValues>
  <enumValues>
    <name>СВ_Титул4</name>
  </enumValues>
  <enumValues>
    <name>СВ_Титул5</name>
  </enumValues>
  <enumValues>
    <name>СВ_Титул6</name>
  </enumValues>
  <enumValues>
    <name>СВ_Титул7</name>
  </enumValues>
  <enumValues>
    <name>СВ_Титул8</name>
  </enumValues>
  <enumValues>
    <name>СВ_Титул9</name>
  </enumValues>
  <enumValues>
    <name>ЗЗ_Титул1</name>
  </enumValues>
  <enumValues>
    <name>ЗЗ_Титул2</name>
  </enumValues>
  <enumValues>
    <name>ПЛ_Титул1</name>
  </enumValues>
  <enumValues>
    <name>ПЛ_Титул2</name>
  </enumValues>
  <enumValues>
    <name>ПЛ_Титул3</name>
  </enumValues>
  <enumValues>
    <name>ПЛ_Титул4</name>
  </enumValues>
  <enumValues>
    <name>ПЛ_Титул5</name>
  </enumValues>
  <enumValues>
    <name>ПЛ_Титул6</name>
  </enumValues>
  <enumValues>
    <name>ДФ_Титул1</name>
  </enumValues>
  <enumValues>
    <name>ДФ_Титул2</name>
  </enumValues>
  <enumValues>
    <name>ЭкспедиторскаяРасписка</name>
  </enumValues>
  <enumValues>
    <name>СкладскаяРасписка</name>
  </enumValues>
  <enumValues>
    <name>ПЭ_ЗаявкаНаМаршрут</name>
  </enumValues>
  <enumValues>
    <name>ПЭ_Титул1</name>
    <comment>Поручение экспедитору (ПЭ). Титул1 (ON_POREXPKLT)</comment>
  </enumValues>
  <enumValues>
    <name>ПЭ_Титул2</name>
    <comment>Поручение экспедитору (ПЭ). Титул2 (подтверждение)</comment>
  </enumValues>
  <enumValues>
    <name>ПЛ_Титул1_5_02</name>
  </enumValues>
  <enumValues>
    <name>ПЛ_Титул2_5_02</name>
  </enumValues>
  <enumValues>
    <name>ПЛ_Титул3_5_02</name>
  </enumValues>
  <enumValues>
    <name>ПЛ_Титул4_5_02</name>
  </enumValues>
  <enumValues>
    <name>ПЛ_Титул5_5_02</name>
  </enumValues>
</mdclass:Enum>

КАКерамика_моя_старая_база/src/Enums/КонтурЛогистика_КатегорииОшибокОбъектов/КонтурЛогистика_КатегорииОшибокОбъектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КонтурЛогистика_КатегорииОшибокОбъектов</name>
  <enumValues>
    <name>Предупреждение</name>
  </enumValues>
  <enumValues>
    <name>Ошибка</name>
  </enumValues>
  <enumValues>
    <name>ОшибкаДиадок</name>
  </enumValues>
  <enumValues>
    <name>ОшибкаДругойСтороны</name>
  </enumValues>
  <enumValues>
    <name>ОшибкаКриптографии</name>
  </enumValues>
</mdclass:Enum>

КАКерамика_моя_старая_база/src/Documents/КонтурЛогистика_ПЛ_Титул5_5_02/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	КонтурЛогистика_ОбработкаДокументовСервер.ОбработкаПолученияПредставленияДокументаТитулаПЛ(Данные, Представление, СтандартнаяОбработка, "5");
	
КонецПроцедуры

#КонецОбласти

#Область ПроверкаЗаполнения

// Функция - Проверить документ
//
// Параметры:
//  ДокументОбъектИлиСсылка - ДокументСсылка, ДокументОбъект - проверяемый документ может передаваться как ссылкой так и объектом
//  ТаблицаОшибок	 		- ТаблицаЗначений - можно передать таблицу с уже найденными ошибками
//  ПараметрыФормированияФайлов - Структура - Значения реквизитов заполнения файла обмена
// 
// Возвращаемое значение:
//  Структура -  см. КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ИнициализироватьСтруктуруРезультатаФункции()
//
Функция ПроверитьДокумент(Знач ДокументОбъектИлиСсылка, ТаблицаОшибок = Неопределено, ПараметрыФормированияФайлов = Неопределено) Экспорт
	
	Если ТаблицаОшибок = Неопределено Тогда
		ТаблицаОшибок = КонтурЛогистика_ПанельОшибокСервер.ИнициализироватьТаблицуОшибок();
	КонецЕсли;
	
	ТекСтатусТитула = РегистрыСведений.КонтурЛогистика_СтатусыТитулов.ПолучитьСтатус(ДокументОбъектИлиСсылка.Ссылка, Истина);
	
	ТаблицаОшибок.Очистить();
	
	Если ТекСтатусТитула = Перечисления.КонтурЛогистика_СтатусыТитулов.Ошибка Тогда
		КонтурЛогистика_ПанельОшибокСервер.ВывестиОшибкуТекущегоТитула(ДокументОбъектИлиСсылка.Ссылка, ТаблицаОшибок)
	КонецЕсли;
	
	КонтурЛогистика_ПанельОшибокСервер.ПроверитьОшибкиПредыдущегоТитула(ДокументОбъектИлиСсылка.Ссылка, ДокументОбъектИлиСсылка.Титул1, ТаблицаОшибок);
	
	Если ТекСтатусТитула = Перечисления.КонтурЛогистика_СтатусыТитулов.Получен 
		Или ТекСтатусТитула = Перечисления.КонтурЛогистика_СтатусыТитулов.ПолученТребуетОбработки 
		Или ТекСтатусТитула = Перечисления.КонтурЛогистика_СтатусыТитулов.ПолученОбработанСПредупреждением Тогда
		
		// TODO понять какие сценарии проверки входящего документа
		
	Иначе
		
		// TODO реализовать проверку документа
		
		КонтурЛогистика_ПанельОшибокСервер.ПроверитьПредупреждения(ДокументОбъектИлиСсылка.Ссылка, ТаблицаОшибок);
		
		КонтурЛогистика_ПанельОшибокСервер.ПроверитьДиадокОшибки(ДокументОбъектИлиСсылка.Ссылка, ТаблицаОшибок);
		
		КонтурЛогистика_ОбщегоНазначенияСервер.ВалидацияВыполненияАвторизации(ДокументОбъектИлиСсылка,
			Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул5_5_02, ТаблицаОшибок);
		
		ПроверитьШапку(ДокументОбъектИлиСсылка, ТаблицаОшибок);
		
		ПроверитьИнфПол(ДокументОбъектИлиСсылка, ТаблицаОшибок);
		
		КонтурЛогистика_ОбработкаДокументовСервер.Валидатор_ПроверитьПодписанта(
			ДокументОбъектИлиСсылка, ТаблицаОшибок,, ПараметрыФормированияФайлов);
		
	КонецЕсли;
	
	КонтурЛогистика_ОбработкаДокументовСервер.Валидатор_ПроверитьРоуминг(ДокументОбъектИлиСсылка, ТаблицаОшибок);

	Результат = КонтурЛогистика_ПанельОшибокСервер.ПолучитьРезультатПроверки(ТаблицаОшибок);
	
	Возврат Результат;
	
КонецФункции

Процедура ПроверитьШапку(Знач Объект, ТаблицаОшибок)
	
	КатегорияОшибка = Перечисления.КонтурЛогистика_КатегорииОшибокОбъектов.Ошибка;
	КатегорияПредупреждение = Перечисления.КонтурЛогистика_КатегорииОшибокОбъектов.Предупреждение;
	
	ДокументТитул1 = Объект.Титул1;
	
	Если НЕ ЗначениеЗаполнено(ДокументТитул1)  Тогда
		
		ТекстОшибки = "Титул не привязан к первому титулу Путевого листа";
		КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
			"ДокументТитул1", КатегорияОшибка, ТекстОшибки, "Указать");
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.ЭППредрейсовыйМО) Тогда
		
		ТекстОшибки = "Не получена подпись сотавителя Т2. Попробуйте выполнить обмен и перезаполнить титул";
		КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
			"ЭППредрейсовыйМО", КатегорияОшибка, ТекстОшибки, "Выполнить обмен");
		
	КонецЕсли;
	
	Если Объект.ЕстьОтказВПодписи И Не ЗначениеЗаполнено(Объект.ПричинаОтказаВПодписи) Тогда 
		
		ТекстОшибки = "Не указана причина отказа в подписи";
		КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
			"ПричинаОтказаВПодписи", КатегорияОшибка, ТекстОшибки, "Указать");
		
	КонецЕсли;
	
	Для Каждого ОбязательныйРевизит Из МассивОбязательныхРеквизитов() Цикл
		
		Если Прав(ОбязательныйРевизит, 6) = "Массив" ИЛИ Прав(ОбязательныйРевизит, 14) = "МассивСтруктур" Тогда 
			Продолжить;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Объект[ОбязательныйРевизит]) Тогда
			
			ОбязательныйРевизитСиноним = Документы.КонтурЛогистика_ПЛ_Титул5_5_02.СинонимРеквизита(ОбязательныйРевизит);
			ТекстОшибки = "Укажите " + ОбязательныйРевизитСиноним;
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(
				ТаблицаОшибок, "", "", ОбязательныйРевизит, КатегорияОшибка, ТекстОшибки, "Указать");
			
		КонецЕсли;
	КонецЦикла;
	
	Если ЗначениеЗаполнено(ДокументТитул1.ОрганизацияМедик) Тогда 
		
		Если Не ДокументТитул1.ОрганизацияМедик.Наш Тогда 
			
			ТекстОшибки = "Организация проводящая медосмотр не Наша";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
				"ДокументТитул1ЛицоМедик", КатегорияОшибка, ТекстОшибки, "Ошибка");
			
		КонецЕсли;
		
		Если ДокументТитул1.ЛицоОформившееПЛ <> ДокументТитул1.ОрганизацияМедик Тогда
			
			Если Не ЗначениеЗаполнено(ДокументТитул1.ОрганизацияМедик.ИНН) Тогда 
				
				ТекстОшибки = "У организация проводящей медосмотр не заполнен ИНН";
				КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
					"ДокументТитул1ЛицоМедик.ИНН", КатегорияОшибка, ТекстОшибки, "Ошибка");
				
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(ДокументТитул1.ОрганизацияМедик.НаименованиеОрганизацииПолное) Тогда 
				
				ТекстОшибки = "У организация проводящей медосмотр не заполнено полное наименование";
				КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
					"ДокументТитул1ЛицоМедик.НаименованиеОрганизацииПолное", КатегорияОшибка, ТекстОшибки, "Ошибка");
				
			КонецЕсли;
			
		КонецЕсли;
		
	Иначе
		
		Если Не ДокументТитул1.ЛицоОформившееПЛ.Наш Тогда 
			
			ТекстОшибки = "Организация оформившая ПЛ и проводящая медосмотр не Наша";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
				"ДокументТитул1ЛицоОформившее", КатегорияОшибка, ТекстОшибки, "Ошибка");
			
		КонецЕсли;
		
	КонецЕсли;
	
	// Водитель
	КонтурЛогистика_ОбработкаДокументовСервер.ПроверитьВодителя(Объект.Водитель, ТаблицаОшибок,
		КатегорияОшибка,, Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул5_5_02, Объект.Титул1);
		
	// Медик
	КонтурЛогистика_ОбработкаДокументовСервер.Валидатор_ПроверитьМедика(Объект, ТаблицаОшибок);
		
	// МедЛицензия
	КонтурЛогистика_ОбработкаДокументовСервер.Валидатор_ПроверитьМедЛицензию(Объект, ТаблицаОшибок);
	
	// Провдение документа основания
	КонтурЛогистика_ОбработкаДокументовСервер.ПроверитьПроведениеДокументаОснования(Объект, ТаблицаОшибок, КатегорияОшибка);
	
	// TODO
	// ГЛУБОКИЕ ВАЛИДАЦИИ, ВЗАИМНЫЕ ВАЛИДАЦИИ
	
КонецПроцедуры

Процедура ПроверитьИнфПол(Знач Объект, ТаблицаОшибок)
	
	СтуктураПроверки = Новый Структура;
	СтуктураПроверки.Вставить("ИнфПол", "");
		
	КонтурЛогистика_ОбработкаДокументовСервер.ПроверитьИнфПолСИдФайл(Объект, СтуктураПроверки, ТаблицаОшибок);
	
КонецПроцедуры

#КонецОбласти

#Область НастройкиКонвертацииДокументов

Функция МассивОбязательныхРеквизитов() Экспорт
	
	МассивОбязательных = Новый Массив();
	
	МассивОбязательных.Добавить("ПользовательПодписант");
	МассивОбязательных.Добавить("МедРаботник");
	МассивОбязательных.Добавить("МедЛицензия");
	МассивОбязательных.Добавить("ДатВрПрМО");
	МассивОбязательных.Добавить("Водитель");
	
	Возврат МассивОбязательных;
	
КонецФункции

Функция МассивОбязательныхРеквизитовТЧ() Экспорт
	
	МассивОбязательных = Новый Массив();
	
	Возврат МассивОбязательных;
	
КонецФункции

Функция МассивУсловноОбязательныхРеквизитов() Экспорт
	
	МассивОбязательных = Новый Массив();
	
	Возврат МассивОбязательных;
	
КонецФункции

Функция МассивУсловноОбязательныхРеквизитовТЧ() Экспорт
	
	МассивОбязательных = Новый Массив();
	
	Возврат МассивОбязательных;
	
КонецФункции

Функция МассивДополнительныхРеквизитов() Экспорт
	
	МассивДополнительных = Новый Массив();
	
	Возврат МассивДополнительных;
	
КонецФункции

Функция МассивДополнительныхРеквизитовТЧ() Экспорт
	
	МассивДополнительных = Новый Массив();
	
	Возврат МассивДополнительных;
	
КонецФункции

Функция КлючевыеРеквизитыСАвтоматическимЗаполнением() Экспорт
	
	МассивКлючевых = Новый Массив();
	
	МассивКлючевых.Добавить("УИД_ПЛ");
	МассивКлючевых.Добавить("Титул1");
	МассивКлючевых.Добавить("Титул2");
	МассивКлючевых.Добавить("ДатФайлИнфМО");
	МассивКлючевых.Добавить("ВрФайлИнфМО");
	МассивКлючевых.Добавить("ИдФайлИнфМО");
	МассивКлючевых.Добавить("ЭППредрейсовыйМО");
	МассивКлючевых.Добавить("СпосПодтПолном");
	МассивКлючевых.Добавить("ТипПодпис");
	МассивКлючевых.Добавить("Должность");
	МассивКлючевых.Добавить("Фамилия");
	МассивКлючевых.Добавить("Имя");
	МассивКлючевых.Добавить("Отчество");
	
	МассивКлючевых.Добавить("ДатИнфПМО");
	МассивКлючевых.Добавить("ВрИнфПМО");
	
	МассивКлючевых.Добавить("РезультатМедОсмотра");
	
	Возврат МассивКлючевых;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СинонимРеквизита(ИмяРеквизита) Экспорт

	Попытка
	
		Возврат Метаданные.Документы.КонтурЛогистика_ПЛ_Титул5_5_02.Реквизиты[ИмяРеквизита].Синоним;
	
	Исключение
		
		//TODO метрику
		Возврат ИмяРеквизита;
		
	КонецПопытки;

КонецФункции

#КонецОбласти

#КонецЕсли
